## pandas json_mormalize

판다스가 제공하는 함수로,

딕셔너리나 리스트가 중첩된 복잡한 JSON데이터를 평평하게 만들어주는 것

**API 호출(`HttpOperator`) 결과**를 DB에 적재하기 전 가공할 때 필수적

In [39]:
import pandas as pd
from pandas import json_normalize
import requests

In [4]:
# 단일 JSON

In [8]:
data={
    "name":"Luke Skywalker",
    "height": "172",
    "mass": "77"
}
df=json_normalize(data)
df

             name height mass
0  Luke Skywalker    172   77

In [5]:
# 리스트 JSON

In [29]:
data = [
    {"name": "Luke", "height": "172", "mass": "77"},
    {"name": "Leia", "height": "150", "mass": "49"}
]
df=json_normalize(data)
df

   name height mass
0  Luke    172   77
1  Leia    150   49

In [44]:
# 중첩된 dict JSON
# 점으로 연결된 새로운 컬럼이름으로 자동 생성

In [42]:
data = [
    {
        "id": 1,
        "name": "Luke Skywalker",
        "location": {              
            "planet": "Tatooine",
            "galaxy": "Outer Rim"
        }
    }
]
df=pd.DataFrame(data)
df

   id            name                                       location
0   1  Luke Skywalker  {'planet': 'Tatooine', 'galaxy': 'Outer Rim'}

In [45]:
# 점으로 연결된 새로운 컬럼이름으로 자동 생성
df=json_normalize(data)
df

   id            name location.planet location.galaxy
0   1  Luke Skywalker        Tatooine       Outer Rim

In [18]:
# 리스트가 섞여있을때
#record_path : 이경로에 있는 리스트를 메인 데이터로 쓸때
# meta : 리스트 밖에 있는 정보도 옆에 붙일때

In [16]:
data = {
    "name": "Luke",
    "films": [
        {"title": "A New Hope", "year": 1977},
        {"title": "Empire Strikes Back", "year": 1980}
    ]
}

In [17]:
df=json_normalize(
    data,
    record_path=['films'],
    meta=['name']
)
df

                 title  year  name
0           A New Hope  1977  Luke
1  Empire Strikes Back  1980  Luke

In [22]:
# 실제 API 실습
# import requests

In [25]:
response=requests.get("https://swapi.dev/api/people/1/").json()
response

{'name': 'Luke Skywalker',
 'height': '172',
 'mass': '77',
 'hair_color': 'blond',
 'skin_color': 'fair',
 'eye_color': 'blue',
 'birth_year': '19BBY',
 'gender': 'male',
 'homeworld': 'https://swapi.dev/api/planets/1/',
 'films': ['https://swapi.dev/api/films/1/',
  'https://swapi.dev/api/films/2/',
  'https://swapi.dev/api/films/3/',
  'https://swapi.dev/api/films/6/'],
 'species': [],
 'vehicles': ['https://swapi.dev/api/vehicles/14/',
  'https://swapi.dev/api/vehicles/30/'],
 'starships': ['https://swapi.dev/api/starships/12/',
  'https://swapi.dev/api/starships/22/'],
 'created': '2014-12-09T13:50:51.644000Z',
 'edited': '2014-12-20T21:17:56.891000Z',
 'url': 'https://swapi.dev/api/people/1/'}

In [28]:
df=json_normalize({
    "name":response["name"],
    "height":response["height"],
    "mass":response["mass"]
})
df

             name height mass
0  Luke Skywalker    172   77